<a href="https://colab.research.google.com/github/Chaitra-07/chai/blob/master/TitanicKaggle.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/gdrive

In [0]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sb

In [0]:
dataset = pd.read_csv('gdrive/My Drive/Indian Engineering Service/train.csv')

In [0]:
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
dataset.shape

(891, 12)

In [0]:
dataset.drop('Cabin',axis = 1, inplace=True)

In [0]:
dataset.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]>

In [0]:
dataset.groupby('Embarked').size()

Embarked
C    168
Q     77
S    644
dtype: int64

In [0]:
common_value = 'S'
dataset['Embarked'] = dataset['Embarked'].fillna(common_value)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [0]:
pd.unique(dataset.Sex)

array(['male', 'female'], dtype=object)

In [0]:
pd.unique(dataset.Embarked)

array(['S', 'C', 'Q'], dtype=object)

In [0]:
sex = pd.get_dummies(dataset['Sex'], drop_first=True)
embark = pd.get_dummies(dataset['Embarked'],drop_first=True)

In [0]:
dataset.drop(['PassengerId' ,'Sex', 'Embarked', 'Name', 'Ticket'], axis = 1 , inplace = True)

In [0]:
dataset = pd.concat([dataset,sex,embark], axis =1)

In [0]:
dataset.shape

(891, 9)

In [0]:
dataset.head()

   Pclass   Age  SibSp  Parch     Fare Cabin  male  Q  S
0     3.0  34.5    0.0    0.0   7.8292   NaN     1  0  1
1     3.0  47.0    1.0    0.0   7.0000   NaN     0  0  0
2     2.0  62.0    0.0    0.0   9.6875   NaN     0  0  1
3     3.0  27.0    0.0    0.0   8.6625   NaN     0  0  1
4     3.0  22.0    1.0    1.0  12.2875   NaN     1  0  1

In [0]:
X_train = dataset.drop('Survived', axis=1)
y_train = dataset['Survived']

In [0]:
from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression()
logmodel.fit(X_train, y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [0]:
logmodel.score(X_train,y_train)

0.8024691358024691

In [0]:
test_dataset = pd.read_csv('gdrive/My Drive/Indian Engineering Service/test.csv')

In [0]:
test_dataset.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
test_dataset.shape

(418, 11)

In [0]:
test_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [0]:
test_dataset['Age'] = test_dataset[['Age','Pclass']].apply(impute_age, axis = 1)
test_dataset.fillna(method='ffill',inplace=True)

In [0]:
sex_test = pd.get_dummies(test_dataset['Sex'], drop_first=True)
embark_test = pd.get_dummies(test_dataset['Embarked'],drop_first=True)

In [0]:
PassengerId = test_dataset['PassengerId']

In [0]:
test_dataset.drop(['PassengerId' ,'Sex', 'Embarked', 'Name', 'Ticket'], axis = 1 , inplace = True)

In [0]:
test_dataset = pd.concat([test_dataset,sex_test,embark_test], axis =1)

In [0]:
test_dataset.drop(['Cabin'], axis = 1 , inplace = True)

In [0]:
test_dataset.shape

(418, 8)

In [0]:
test_dataset.head()

   Pclass   Age  SibSp  Parch     Fare  male  Q  S
0       3  34.5      0      0   7.8292     1  1  0
1       3  47.0      1      0   7.0000     0  0  1
2       2  62.0      0      0   9.6875     1  1  0
3       3  27.0      0      0   8.6625     1  0  1
4       3  22.0      1      1  12.2875     0  0  1

In [0]:
X_test=test_dataset

In [0]:
y_pred_test = logmodel.predict(X_test)

In [0]:
y_pred_test[0:5]

array([0, 0, 0, 0, 1])

In [0]:
finalDf = pd.DataFrame({"PassengerId":PassengerId , "Survived":y_pred_test})

In [0]:
finalDf.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [0]:
finalDf.shape

(418, 2)

In [0]:
finalDf.to_csv("titanc_predictions.csv", index =False)

# New Section